case/oilWaterParticlesInterIsoFoam/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// Same 4 oil droplets (by position and radius) as InterFoamSimulation's
// case, so isoAdvector and MULES advect the identical initial interface.
defaultFieldValues
(
    volScalarFieldValue alpha.water 1
);

regions
(
    // Oil droplet 1 (largest, R=0.12 m)
    sphereToCell
    {
        centre (0.25 0.30 0.005);
        radius 0.12;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }

    sphereToCell
    {
        centre (0.50 0.55 0.005);
        radius 0.10;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }

    sphereToCell
    {
        centre (0.75 0.35 0.005);
        radius 0.08;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }

    sphereToCell
    {
        centre (0.70 0.75 0.005);
        radius 0.07;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }
);
